import React from "react";
import "./FAQ.css";
import "./FAQ.mobile.css";

const FAQ = () => {
  const faqItems = [
    {
      question: "А якщо я в цьому нічого не тямлю?",
      answer: (
        <>
          Нічого страшного — Вам не потрібно нічого знати про HTML, CSS чи
          програмування. Ми робимо всю роботу за Вас. Все, що потрібно від Вас —
          відповісти на кілька простих запитань у брифі, щоб ми зрозуміли ваші
          потреби та стиль. Детальніше дивіться у розділі{" "}
          <a href="/briefs" className="nav-btn">
            Отримати бриф
          </a>
          .
        </>
      ),
    },
    {
      question: "Скільки часу йде на створення?",
      answer: (
        <>
          Терміни залежать від типу сторінки та обсягу роботи. Зазвичай
          створення займає від кількох годин до 3 днів. Якщо проєкт складніший,
          ми завчасно повідомимо Вам, скільки часу потрібно, щоб Ви могли
          планувати свій графік.
        </>
      ),
    },
    {
      question: "А можна щось підправити, якщо мені не сподобається?",
      answer: (
        <>
          Так, звісно. Після перегляду готової сторінки Ви зможете сказати, що
          саме хочете змінити або підкоригувати. Ми внесемо правки, щоб
          результат повністю відповідав Вашим очікуванням.
        </>
      ),
    },
    {
      question: "Як розмістити своє резюме, портфоліо або лендінг?",
      answer: (
        <>
          Ви отримаєте архів з усіма файлами та детальну інструкцію, як ними
          користуватися. Крім того, за потреби ми можемо розмістити сторінку в
          інтернеті для Вас, щоб вона була доступна для перегляду будь-кому.
          Детальніше у розділі{" "}
          <a href="/instruction" className="nav-btn">
            Реєстрація на Netlify
          </a>
          .
        </>
      ),
    },
    {
      question: "А якщо я щось забуду або не зрозумію?",
      answer: (
        <>
          Не хвилюйтеся — Ви завжди можете звернутися до нас через Viber або
          Telegram. Ми допоможемо розібратися, нагадаємо порядок дій та
          відповімо на всі запитання. Мета — щоб у Вас залишився тільки готовий
          результат без стресу.
        </>
      ),
    },
  ];

  return (
    <section id="faq" className="faq-section">
      <h2 id="faq-title">Поширені запитання</h2>
      {faqItems.map((item, index) => (
        <details key={index}>
          <summary>{item.question}</summary>
          <p>{item.answer}</p>
        </details>
      ))}
    </section>
  );
};

export default FAQ;
